GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*
   获取08存储的状态 48小时 单位分钟内每秒的速度状态2byte
   48*60*128=2880*128=368640 (bytes)
   368640/4096=90(sectors)

   格式:
   <'8'><mydatetime(4bytes><60秒的速度状态120bytes>
   循环递增
 */
/*
	   获取09存储的状态 360小时每分钟位置速度状态记录
	   360*60*11
	
	   每分钟记录占用16byte;
	   总共需要 360*60*16=345600bytes
	   345600/4096=84.375 =>85Sector
	   格式:
	   <'9'><mydatatime 4byte><分钟位置速度11byte>
 */

/*
   获取09存储的状态 360小时每分钟位置速度状态记录
   360*60*11

   每分钟记录占用16byte;
   总共需要 360*60*16=345600bytes
   345600/4096=84.375 =>85Sector
   格式:
   <'9'><mydatatime 4byte><分钟位置速度11byte>
 */


static void vdr_init_08( uint8_t *p )
{
	uint8_t		sect, rec, offset;
	uint8_t		*prec;
	uint8_t		find		= 0;
	uint32_t	mytime_curr = 0;
	uint32_t	mytime_vdr	= 0;
	uint32_t	addr		= 0;

	for( sect = 0; sect < VDR_08_SECTORS; sect++ )
	{
		sst25_read( VDR_08_START + sect * 4096, p, 4096 );
		for( rec = 0; rec < 64; rec++ )
		{
			prec = p + rec * 128;
			if( prec[0] == '8' )                                                                    /*是有效的数据包*/
			{
				mytime_curr = MYDATETIME( prec[1], prec[2], prec[3], prec[4], prec[5], prec[6] );   /*整分钟时刻*/
				if( mytime_curr > mytime_vdr )
				{
					mytime_vdr	= mytime_curr;
					addr			= VDR_08_START + sect * 4096 + rec * 128;
					find			= 1;
				}
			}
		}
	}
	if( find ) /*找到了,指向下一个可用的地址,注意环回*/
	{
		vdr_08_addr = addr + 0x80;
		if( vdr_08_addr >= ( VDR_08_START + sect * 4096 ) )
		{
			vdr_08_addr = VDR_08_START;
		}
	}
	rt_kprintf( "\r\n%d>datetime:%d-%d-%d %d:%d:%d", rt_tick_get( ), YEAR( mytime_vdr ), MONTH( mytime_vdr ), DAY( mytime_vdr ), HOUR( mytime_vdr ), MINUTE( mytime_vdr ), SEC( mytime_vdr ) );
}

/*
   获取09存储的状态 360小时每分钟位置速度状态记录
   360*60*11

   每分钟记录占用16byte;
   总共需要 360*60*16=345600bytes
   345600/4096=84.375 =>85Sector
   格式:
   <'9'><mydatatime 4byte><分钟位置速度11byte>
 */

static void vdr_init_09( uint8_t *p )
{
	uint8_t		sect, rec, offset;
	uint8_t		*prec;
	uint8_t		find;
	uint32_t	mytime_curr;
	uint32_t	mytime_vdr	= 0;
	uint32_t	addr			= 0;

	for( sect = 0; sect < VDR_09_SECTORS; sect++ )
	{
		sst25_read( VDR_09_START + sect * 4096, p, 4096 );
		for( rec = 0; rec < 64; rec++ )
		{
			prec = p + rec * 16;
			if( prec[0] == '9' )                                                                    /*是有效的数据包*/
			{
				mytime_curr = MYDATETIME( prec[1], prec[2], prec[3], prec[4], prec[5], prec[6] );   /*整分钟时刻*/
				if( mytime_curr > mytime_vdr )
				{
					mytime_vdr	= mytime_curr;
					addr			= VDR_09_START + sect * 4096 + rec * 16;
					find			= 1;
				}
			}
		}
	}
	if( find ) /*找到了,指向下一个可用的地址,注意环回*/
	{
		vdr_09_addr = addr + 0x10;
		if( vdr_09_addr >= ( VDR_09_START + sect * 4096 ) )
		{
			vdr_09_addr = VDR_09_START;
		}
	}
	rt_kprintf( "\r\n%d>datetime:%d-%d-%d %d:%d:%d", rt_tick_get( ), YEAR( mytime_vdr ), MONTH( mytime_vdr ), DAY( mytime_vdr ), HOUR( mytime_vdr ), MINUTE( mytime_vdr ), SEC( mytime_vdr ) );
}

/*
   获取09存储的状态 360小时每分钟位置速度状态记录
   360*60*11

   每分钟记录占用16byte;
   总共需要 360*60*16=345600bytes
   345600/4096=84.375 =>85Sector
   格式:
   <'9'><mydatatime 4byte><分钟位置速度11byte>
 */

static void vdr_init_10( uint8_t *p )
{
	uint8_t		sect, rec, offset;
	uint8_t		*prec;
	uint8_t		find;
	uint32_t	mytime_curr;
	uint32_t	mytime_vdr	= 0;
	uint32_t	addr			= 0;

	for( sect = 0; sect < VDR_09_SECTORS; sect++ )
	{
		sst25_read( VDR_09_START + sect * 4096, p, 4096 );
		for( rec = 0; rec < 64; rec++ )
		{
			prec = p + rec * 16;
			if( prec[0] == '9' )                                                                    /*是有效的数据包*/
			{
				mytime_curr = MYDATETIME( prec[1], prec[2], prec[3], prec[4], prec[5], prec[6] );   /*整分钟时刻*/
				if( mytime_curr > mytime_vdr )
				{
					mytime_vdr	= mytime_curr;
					addr			= VDR_09_START + sect * 4096 + rec * 16;
					find			= 1;
				}
			}
		}
	}
	if( find ) /*找到了,指向下一个可用的地址,注意环回*/
	{
		vdr_10_addr = addr + 0x10;
		if( vdr_09_addr >= ( VDR_09_START + sect * 4096 ) )
		{
			vdr_09_addr = VDR_09_START;
		}
	}
	rt_kprintf( "\r\n%d>datetime:%d-%d-%d %d:%d:%d", rt_tick_get( ), YEAR( mytime_vdr ), MONTH( mytime_vdr ), DAY( mytime_vdr ), HOUR( mytime_vdr ), MINUTE( mytime_vdr ), SEC( mytime_vdr ) );
}

/*
   初始化记录区数据
   因为是属于固定时间段存储的
   需要记录开始时刻的sector位置(相对的sector偏移)
 */
rt_err_t vdr_init( void )
{
	uint8_t* pbuf;
	pbuf = rt_malloc( 4096 );
	if( pbuf == RT_NULL )
	{
		return -RT_ENOMEM;
	}
	vdr_init_08( pbuf );
	vdr_init_09( pbuf );

	rt_free( pbuf );
	pbuf = RT_NULL;
}

/*
   收到gps数据的处理
   存储位置信息，
   速度判断，校准
 */

rt_err_t vdr_rx( void )
{
}

/************************************** The End Of File **************************************/
